In [5]:
import pandas as pd
import numpy as np

In [7]:
data = {
    "student_id": [32, 217, 779, 849],
    "name": ['Piper', np.nan, 'Georgia', 'Willow'],
    "age":  [5, 19, 20, 14]
}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

   student_id     name  age
0          32    Piper    5
1         217      NaN   19
2         779  Georgia   20
3         849   Willow   14

In [10]:
df = df.dropna(subset=['name'])

In [11]:
df

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14